<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
     */

    'accepted' => 'Атрибутът трябва да бъде приет.',
    'active_url' => 'Атрибутът: не е валиден URL адрес.',
    'after' => 'Атрибутът: трябва да бъде дата след: дата.',
    'after_or_equal' => 'Атрибутът трябва да бъде дата след или равна на: date.',
    'alpha' => 'Атрибутът може да съдържа само букви.',
    'alpha_dash' => 'Атрибутът може да съдържа само букви, цифри, тирета и долни черти.',
    'alpha_num' => 'Атрибутът може да съдържа само букви и цифри.',
    'array' => 'Атрибутът трябва да бъде масив.',
    'before' => 'Атрибутът трябва да бъде дата преди: дата.',
    'before_or_equal' => 'Атрибутът трябва да бъде дата преди или равна на: date.',
    'between' => [
        'numeric' => 'Атрибутът трябва да е между: min и: max.',
        'file' => 'Атрибутът трябва да бъде между: min и: max kilobytes.',
        'string' => 'Атрибутът трябва да бъде между: min и: max знака.',
        'array' => 'Атрибутът трябва да има между: min и: max елементи.',
    ],
    'boolean' => 'Полето на атрибута трябва да е вярно или невярно.',
    'confirm' => 'Потвърждението на атрибута не съвпада.',
    'date' => 'Атрибутът: не е валидна дата.',
    'date_equals' => 'Атрибутът трябва да бъде дата, равна на: date.',
    'date_format' => 'Атрибутът: не съответства на формата: формат.',
    'different' => 'Атрибутът: и: друг трябва да е различен.',
    'figures' => 'Атрибутът трябва да бъде: цифри от цифри.',
    'figures_between' => 'Атрибутът трябва да бъде между: min и: max цифри.',
    'dimensions' => 'Атрибутът: има невалидни размери на изображението.',
    'distinct' => 'Полето атрибут има двойна стойност.',
    'email' => 'Атрибутът трябва да е валиден имейл адрес.',
    'ends_with' => 'Атрибутът трябва да завършва с едно от следните:: values',
    'exist' => 'Атрибутът selected: е невалиден.',
    'file' => 'Атрибутът трябва да бъде файл.',
    'filled' => 'Полето атрибут трябва да има стойност.',
    'gt' => [
        'numeric' => 'Атрибутът трябва да е по-голям от: value.',
        'file' => 'Атрибутът трябва да бъде по-голям от: стойност килобайт.',
        'string' => 'Атрибутът трябва да бъде по-голям от: символи стойност.',
        'array' => 'Атрибутът трябва да има повече от: стойност елементи.',
    ],
    "gte" => [
        'numeric' => 'Атрибутът трябва да е по-голям или равен: стойност.',
        'file' => 'Атрибутът трябва да е по-голям или равен: стойност килобайт.',
        'string' => 'Атрибутът трябва да бъде по-голям или равен: стойност символи.',
        'array' => 'Атрибутът трябва да има: стойностни елементи или повече.',
    ],
    'image' => 'Атрибутът трябва да бъде изображение.',
    'in' => 'Избраният атрибут е невалиден.',
    'in_array' => 'Полето атрибут не съществува в: other.',
    'integer' => 'Атрибутът трябва да бъде цяло число.',
    'ip' => 'Атрибутът трябва да е валиден IP адрес.',
    'ipv4' => 'Атрибутът трябва да е валиден IPv4 адрес.',
    'ipv6' => 'Атрибутът трябва да е валиден IPv6 адрес.',
    'json' => 'Атрибутът трябва да е валиден JSON низ.',
    'lt' => [
        'numeric' => 'Атрибутът трябва да бъде по-малък от: value.',
        'file' => 'Атрибутът трябва да бъде по-малък от: стойност килобайт.',
        'string' => 'Атрибутът трябва да бъде по-малък от: символи стойност.',
        'array' => 'Атрибутът трябва да има по-малко от: стойност елементи.',
    ],
    'lte' => [
        'numeric' => 'Атрибутът трябва да бъде по-малък или равен: стойност.',
        'file' => 'Атрибутът трябва да бъде по-малък или равен: стойност килобайт.',
        'string' => 'Атрибутът трябва да бъде по-малък или равен: стойност символи.',
        'array' => 'Атрибутът: не трябва да има повече от: стойност елементи.',
    ],
    'max' => [
        'numeric' => 'Атрибутът не може да бъде по-голям от: max.',
        'file' => 'Атрибутът не може да бъде по-голям от: max килобайт.',
        'string' => 'Атрибутът: не може да бъде по-голям от: max знака.',
        'array' => 'Атрибутът не може да има повече от: max елементи.',
    ],
    'mimes' => 'Атрибутът трябва да бъде файл от тип:: value.',
    'mimetypes' => 'Атрибутът трябва да бъде файл от тип:: значения.',
    'min' => [
        'numeric' => 'Атрибутът трябва да бъде поне: min.',
        'file' => 'Атрибутът трябва да бъде най-малко: min килобайти.',
        'string' => 'Атрибутът трябва да бъде поне: min знака.',
        'array' => 'Атрибутът трябва да има поне: min елементи.',
    ],
    'not_in' => 'Избраният атрибут е невалиден.',
    'not_regex' => 'Форматът на атрибута е невалиден.',
    'numeric' => 'Атрибутът трябва да бъде число.',
    'present' => 'Полето атрибут трябва да присъства.',
    'regex' => 'Форматът на атрибута е невалиден.',
    'required' => 'Полето атрибут е задължително.',
    'required_if' => 'Полето атрибут е задължително, когато: other е: value.',
    'required_unless' => 'Полето атрибут е задължително, освен ако: друго е в: стойности.',
    'required_with' => 'Полето атрибут е задължително, когато: стойности присъстват.',
    'required_with_all' => 'Полето атрибут е задължително, когато: присъстват стойности.',
    'required_without' => 'Полето атрибут е задължително, когато: стойностите не присъстват.',
    'required_without_all' => 'Полето атрибут е задължително, когато не са налице: стойности.',
    'same' => 'Атрибутът и: друг трябва да съвпадат.',
    'size' => [
        'numeric' => 'Атрибутът трябва да бъде: size.',
        'file' => 'Атрибутът трябва да бъде: размер на килобайта.',
        'string' => 'Атрибутът трябва да бъде: знаци за размер.',
        'array' => 'Атрибутът трябва да съдържа: елементи на размера.',
    ],
    'starts_with' => 'Атрибутът трябва да започва с едно от следните:: values',
    'string' => 'Атрибутът трябва да е низ.',
    'timezone' => 'Атрибутът трябва да бъде валидна зона.',
    'unique' => 'Атрибутът: вече е зает. ',
    'uploaded' => 'Атрибутът за неуспешно качване.',
    'url' => 'Форматът на атрибута е невалиден.',
    'uuid' => 'Атрибутът трябва да бъде валиден UUID.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
     */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
     */

    'attributes' => [],

];
